## `terraform/scheduling`
#### Terraform Format and Style 🖌`'No changes needed.'`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.custom_lambda.module.user_action_filter_function.data.external.archive_prepare[0]: Reading...
module.custom_lambda.module.user_action_filter_function.data.external.archive_prepare[0]: Read complete after 1s [id=-]
module.custom_lambda.module.user_action_filter_function.local_file.archive_plan[0]: Refreshing state... [id=421827469ade4a6f146fa8ac3fc4b3f8da27703b]
module.custom_lambda.module.user_action_filter_function.null_resource.archive[0]: Refreshing state... [id=2148606210614592634]
module.custom_nlb.module.nlb.data.aws_partition.current: Reading...
data.aws_iam_role.task_execution_role: Reading...
data.aws_iam_role.task_role: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.assume_role[0]: Reading...
module.custom_domain.data.aws_route53_zone.mydomain: Reading...
module.custom_nlb.module.nlb.aws_lb_listener.frontend_http_tcp[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:listener/net/minecraft-test-nlb/f4a8965c180a4a7d/0163e8d7baa29343]
module.custom_domain.aws_cloudfront_origin_access_control.s3_origin_access_control: Refreshing state... [id=E2KLHUQD90RTJ9]
module.custom_nlb.module.nlb.aws_lb_target_group.main[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:targetgroup/tf-20240625012436511900000001/d746e45f4a0d00f8]
module.custom_cloudwatch.aws_cloudwatch_log_group.firelens: Refreshing state... [id=/aws/ecs/minecraft-firelens-logs]
module.custom_ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:528163014577:cluster/minecraft-test-cluster]
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.assume_role[0]: Read complete after 0s [id=2690255455]
module.custom_nlb.module.nlb.data.aws_partition.current: Read complete after 0s [id=aws]
module.custom_domain.data.aws_cloudfront_cache_policy.optimized: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_partition.current: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_partition.current: Read complete after 0s [id=aws]
data.aws_vpc.myvpc: Reading...
data.aws_iam_role.task_role: Read complete after 0s [id=ecs_tasks-minecraft-test-role]
data.aws_kms_key.my_kms: Reading...
data.aws_security_group.fargate_sg: Reading...
data.aws_iam_role.task_execution_role: Read complete after 0s [id=minecraft-test-ecs_tasks_execution-role]
module.custom_domain.data.aws_s3_bucket.dynmap_bucket: Reading...
module.custom_domain.data.aws_cloudfront_cache_policy.optimized: Read complete after 0s [id=658327ea-f89d-4fab-a63d-7e88639e58f6]
module.custom_lambda.module.user_action_filter_function.data.aws_region.current: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_region.current: Read complete after 0s [id=ap-northeast-1]
module.custom_lambda.module.user_action_filter_function.data.aws_caller_identity.current: Reading...
module.custom_domain.data.aws_route53_zone.mydomain: Read complete after 0s [id=Z006257634KDWA8TCRYLE]
data.aws_sns_topic.my_sns: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_caller_identity.current: Read complete after 1s [id=528163014577]
module.custom_lambda.module.user_action_filter_function.aws_cloudwatch_log_group.lambda[0]: Refreshing state... [id=/aws/lambda/user-action-filter-function]
data.aws_kms_key.my_kms: Read complete after 1s [id=fbe3a2e1-dee7-431a-8206-9cd2092c08df]
module.custom_lambda.module.user_action_filter_function.aws_iam_role.lambda[0]: Refreshing state... [id=user-action-filter-function]
data.aws_security_group.fargate_sg: Read complete after 1s [id=sg-07934f64784cd1b97]
module.custom_domain.data.aws_s3_bucket.dynmap_bucket: Read complete after 1s [id=minecraft-dynmaps]
module.custom_domain.aws_s3_bucket_public_access_block.dynmap_bucket: Refreshing state... [id=minecraft-dynmaps]
module.custom_domain.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E3EB67M0BSYO03]
data.aws_sns_topic.my_sns: Read complete after 1s [id=arn:aws:sns:ap-northeast-1:528163014577:minecraft-test-sns-topic]
module.custom_lambda.module.user_action_filter_function.aws_iam_policy.additional_json[0]: Refreshing state... [id=arn:aws:iam::528163014577:policy/user-action-filter-function]
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.logs[0]: Reading...
module.custom_lambda.module.user_action_filter_function.data.aws_iam_policy_document.logs[0]: Read complete after 0s [id=1875139620]
module.custom_lambda.module.user_action_filter_function.aws_iam_policy.logs[0]: Refreshing state... [id=arn:aws:iam::528163014577:policy/user-action-filter-function-logs]
module.custom_domain.aws_route53_record.dynmap_dns: Refreshing state... [id=Z006257634KDWA8TCRYLE_dynmap.smat710.com_A]
module.custom_domain.data.aws_iam_policy_document.s3_main_policy: Reading...
module.custom_domain.data.aws_iam_policy_document.s3_main_policy: Read complete after 0s [id=1138553640]
module.custom_domain.aws_s3_bucket_policy.allow_access_from_cloudfront: Refreshing state... [id=minecraft-dynmaps]
module.custom_lambda.module.user_action_filter_function.aws_iam_role_policy_attachment.additional_json[0]: Refreshing state... [id=user-action-filter-function-20240624234043480900000005]
module.custom_lambda.module.user_action_filter_function.aws_iam_role_policy_attachment.logs[0]: Refreshing state... [id=user-action-filter-function-20240624234043424500000004]
module.custom_lambda.module.user_action_filter_function.aws_lambda_function.this[0]: Refreshing state... [id=user-action-filter-function]
data.aws_vpc.myvpc: Read complete after 2s [id=vpc-080b3749ba65ae3d7]
data.aws_subnets.my_subnets: Reading...
module.custom_ecs.aws_ecs_task_definition.main: Refreshing state... [id=minecraft-test]
data.aws_subnets.my_subnets: Read complete after 0s [id=ap-northeast-1]
module.custom_nlb.module.nlb.aws_lb.this[0]: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:loadbalancer/net/minecraft-test-nlb/f4a8965c180a4a7d]
module.custom_lambda.aws_cloudwatch_log_subscription_filter.user-action_subscription["1"]: Refreshing state... [id=cwlsf-384885153]
module.custom_lambda.aws_cloudwatch_log_subscription_filter.user-action_subscription["0"]: Refreshing state... [id=cwlsf-384885153]
module.custom_lambda.aws_lambda_permission.log_permission: Refreshing state... [id=terraform-20240624234057473000000007]
module.custom_ecs.aws_ecs_service.main: Refreshing state... [id=arn:aws:ecs:ap-northeast-1:528163014577:service/minecraft-test-cluster/minecraft-test-service]
module.custom_cloudwatch.aws_cloudwatch_metric_alarm.memory_utilization: Refreshing state... [id=minecraft-test-memory_utilization]
module.custom_cloudwatch.aws_cloudwatch_metric_alarm.task_running_count: Refreshing state... [id=minecraft-test-task_running_count]
module.custom_cloudwatch.aws_cloudwatch_metric_alarm.cpu_utilization: Refreshing state... [id=minecraft-test-cpu_utilization]
module.custom_nlb.null_resource.send_slack_notification: Refreshing state... [id=916082285948606521]
module.custom_domain.aws_route53_record.apps_dns: Refreshing state... [id=Z006257634KDWA8TCRYLE_minecraft.smat710.com_A]
module.custom_cloudwatch.aws_cloudwatch_metric_alarm.target_group_health_check: Refreshing state... [id=minecraft-test-targetgroup_healthy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.custom_cloudwatch.aws_cloudwatch_metric_alarm.target_group_health_check will be updated in-place
  ~ resource "aws_cloudwatch_metric_alarm" "target_group_health_check" {
      ~ dimensions                = {
          - "LoadBalancer" = "net/minecraft-test-nlb/f4a8965c180a4a7d"
          - "TargetGroup"  = "targetgroup/tf-20240625012436511900000001/d746e45f4a0d00f8"
        } -> (known after apply)
        id                        = "minecraft-test-targetgroup_healthy"
        tags                      = {}
        # (17 unchanged attributes hidden)
    }

  # module.custom_ecs.aws_ecs_service.main will be updated in-place
  ~ resource "aws_ecs_service" "main" {
        id                                 = "arn:aws:ecs:ap-northeast-1:528163014577:service/minecraft-test-cluster/minecraft-test-service"
        name                               = "minecraft-test-service"
        tags                               = {}
        # (16 unchanged attributes hidden)

      - load_balancer {
          - container_name   = "minecraft" -> null
          - container_port   = 25565 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:targetgroup/tf-20240625012436511900000001/d746e45f4a0d00f8" -> null
        }
      + load_balancer {
          + container_name   = "minecraft"
          + container_port   = 25565
          + target_group_arn = (known after apply)
        }

        # (3 unchanged blocks hidden)
    }

  # module.custom_ecs.aws_ecs_task_definition.main must be replaced
-/+ resource "aws_ecs_task_definition" "main" {
      ~ arn                      = "arn:aws:ecs:ap-northeast-1:528163014577:task-definition/minecraft-test:182" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:ap-northeast-1:528163014577:task-definition/minecraft-test" -> (known after apply)
      ~ container_definitions    = (sensitive value) # forces replacement
      ~ id                       = "minecraft-test" -> (known after apply)
      ~ revision                 = 182 -> (known after apply)
      - tags                     = {} -> null
      ~ tags_all                 = {} -> (known after apply)
        # (9 unchanged attributes hidden)

      - volume {
          - configure_at_launch = false -> null
          - name                = "data" -> null
        }
      - volume {
          - configure_at_launch = false -> null
          - name                = "log-volume" -> null
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "data"
        }
      + volume {
          + configure_at_launch = (known after apply)
          + name                = "log-volume"
        }
    }

  # module.custom_lambda.module.user_action_filter_function.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "user-action-filter-function"
      ~ qualified_arn                  = "arn:aws:lambda:ap-northeast-1:528163014577:function:user-action-filter-function:74" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:ap-northeast-1:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-northeast-1:528163014577:function:user-action-filter-function:74/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "74" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "WEB_HOOK_URL"  = (sensitive value)
                # (2 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.custom_nlb.module.nlb.aws_lb.this[0] will be updated in-place
  ~ resource "aws_lb" "this" {
      ~ enable_cross_zone_load_balancing                             = false -> true
      + enforce_security_group_inbound_rules_on_private_link_traffic = "off"
        id                                                           = "arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:loadbalancer/net/minecraft-test-nlb/f4a8965c180a4a7d"
        name                                                         = "minecraft-test-nlb"
      ~ security_groups                                              = [] -> (known after apply)
      ~ tags                                                         = {
          - "Name"                  = "minecraft-test-nlb" -> null
            "environment"           = "test"
            "owners"                = "minecraft"
          + "terraform-aws-modules" = "alb"
        }
      ~ tags_all                                                     = {
          - "Name"                  = "minecraft-test-nlb" -> null
          + "terraform-aws-modules" = "alb"
            # (2 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

      ~ timeouts {
          - create = "10m" -> null
          - delete = "10m" -> null
          - update = "10m" -> null
        }

        # (3 unchanged blocks hidden)
    }

  # module.custom_nlb.module.nlb.aws_lb_listener.frontend_http_tcp[0] will be destroyed
  # (because aws_lb_listener.frontend_http_tcp is not in configuration)
  - resource "aws_lb_listener" "frontend_http_tcp" {
      - arn               = "arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:listener/net/minecraft-test-nlb/f4a8965c180a4a7d/0163e8d7baa29343" -> null
      - id                = "arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:listener/net/minecraft-test-nlb/f4a8965c180a4a7d/0163e8d7baa29343" -> null
      - load_balancer_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:loadbalancer/net/minecraft-test-nlb/f4a8965c180a4a7d" -> null
      - port              = 25565 -> null
      - protocol          = "TCP" -> null
      - tags              = {
          - "environment" = "test"
          - "owners"      = "minecraft"
        } -> null
      - tags_all          = {
          - "environment" = "test"
          - "owners"      = "minecraft"
        } -> null

      - default_action {
          - order            = 1 -> null
          - target_group_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:targetgroup/tf-20240625012436511900000001/d746e45f4a0d00f8" -> null
          - type             = "forward" -> null
        }
    }

  # module.custom_nlb.module.nlb.aws_lb_listener.this["ex-one"] will be created
  + resource "aws_lb_listener" "this" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + load_balancer_arn = "arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:loadbalancer/net/minecraft-test-nlb/f4a8965c180a4a7d"
      + port              = 25565
      + protocol          = "TCP"
      + ssl_policy        = (known after apply)
      + tags              = {
          + "environment"           = "test"
          + "owners"                = "minecraft"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all          = {
          + "environment"           = "test"
          + "owners"                = "minecraft"
          + "terraform-aws-modules" = "alb"
        }

      + default_action {
          + order            = (known after apply)
          + target_group_arn = (known after apply)
          + type             = "forward"
        }
    }

  # module.custom_nlb.module.nlb.aws_lb_target_group.main[0] will be destroyed
  # (because aws_lb_target_group.main is not in configuration)
  - resource "aws_lb_target_group" "main" {
      - arn                                = "arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:targetgroup/tf-20240625012436511900000001/d746e45f4a0d00f8" -> null
      - arn_suffix                         = "targetgroup/tf-20240625012436511900000001/d746e45f4a0d00f8" -> null
      - connection_termination             = false -> null
      - deregistration_delay               = "10" -> null
      - id                                 = "arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:targetgroup/tf-20240625012436511900000001/d746e45f4a0d00f8" -> null
      - ip_address_type                    = "ipv4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:ap-northeast-1:528163014577:loadbalancer/net/minecraft-test-nlb/f4a8965c180a4a7d",
        ] -> null
      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
      - name                               = "tf-20240625012436511900000001" -> null
      - name_prefix                        = "tf-" -> null
      - port                               = 25565 -> null
      - preserve_client_ip                 = "false" -> null
      - protocol                           = "TCP" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {
          - "Name"        = ""
          - "environment" = "test"
          - "owners"      = "minecraft"
        } -> null
      - tags_all                           = {
          - "Name"        = ""
          - "environment" = "test"
          - "owners"      = "minecraft"
        } -> null
      - target_type                        = "ip" -> null
      - vpc_id                             = "vpc-080b3749ba65ae3d7" -> null

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 2 -> null
          - interval            = 30 -> null
          - port                = "traffic-port" -> null
          - protocol            = "TCP" -> null
          - timeout             = 20 -> null
          - unhealthy_threshold = 2 -> null
        }

      - stickiness {
          - cookie_duration = 0 -> null
          - enabled         = false -> null
          - type            = "source_ip" -> null
        }

      - target_failover {}

      - target_health_state {
          - enable_unhealthy_connection_termination = true -> null
        }
    }

  # module.custom_nlb.module.nlb.aws_lb_target_group.this["ex-target-one"] will be created
  + resource "aws_lb_target_group" "this" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "10"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = "false"
      + name                               = (known after apply)
      + name_prefix                        = (known after apply)
      + port                               = 25565
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "TCP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "environment"           = "test"
          + "owners"                = "minecraft"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all                           = {
          + "environment"           = "test"
          + "owners"                = "minecraft"
          + "terraform-aws-modules" = "alb"
        }
      + target_type                        = "ip"
      + vpc_id                             = "vpc-080b3749ba65ae3d7"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 60
          + matcher             = (known after apply)
          + path                = (known after apply)
          + port                = "traffic-port"
          + protocol            = "TCP"
          + timeout             = 50
          + unhealthy_threshold = 2
        }
    }

  # module.custom_nlb.module.nlb.aws_security_group.this[0] will be created
  + resource "aws_security_group" "this" {
      + arn                    = (known after apply)
      + description            = "Security group for minecraft-test-nlb network load balancer"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = (known after apply)
      + name_prefix            = "minecraft-test-nlb-"
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "environment"           = "test"
          + "owners"                = "minecraft"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "environment"           = "test"
          + "owners"                = "minecraft"
          + "terraform-aws-modules" = "alb"
        }
      + vpc_id                 = "vpc-080b3749ba65ae3d7"
    }

  # module.custom_nlb.module.nlb.aws_vpc_security_group_egress_rule.this["all"] will be created
  + resource "aws_vpc_security_group_egress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "10.0.0.0/16"
      + id                     = (known after apply)
      + ip_protocol            = "-1"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "environment"           = "test"
          + "owners"                = "minecraft"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "environment"           = "test"
          + "owners"                = "minecraft"
          + "terraform-aws-modules" = "alb"
        }
    }

  # module.custom_nlb.module.nlb.aws_vpc_security_group_ingress_rule.this["all_tcp"] will be created
  + resource "aws_vpc_security_group_ingress_rule" "this" {
      + arn                    = (known after apply)
      + cidr_ipv4              = "0.0.0.0/0"
      + description            = "TCP traffic"
      + from_port              = 25565
      + id                     = (known after apply)
      + ip_protocol            = "tcp"
      + security_group_id      = (known after apply)
      + security_group_rule_id = (known after apply)
      + tags                   = {
          + "environment"           = "test"
          + "owners"                = "minecraft"
          + "terraform-aws-modules" = "alb"
        }
      + tags_all               = {
          + "environment"           = "test"
          + "owners"                = "minecraft"
          + "terraform-aws-modules" = "alb"
        }
      + to_port                = 25565
    }

Plan: 6 to add, 4 to change, 3 to destroy.

Changes to Outputs:
  + nlb_target_group_arns     = [
      + (known after apply),
    ]
  + target_group_arn_suffixes = [
      + (known after apply),
    ]
  - vpc_cidr_block            = "10.0.0.0/16" -> null
  - vpc_id                    = "vpc-080b3749ba65ae3d7" -> null

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>